[["Architecture and engineering occupations %", "all kinds of engineers except software engineers, architects, surveyors, drafters, etc."], ["Computer and mathematical occupations %", "software developers, software QA engineers, system administrators, actuaries, operations researchers"], ["Life, physical, and social science occupations %", "biological scientists, chemists, physicists, geologists, food scientists, economists, phychologists, urban planners, sociologists, scientific technicians, etc."], ["Arts, design, entertainment, sports, and media occupations %", "artists, designers, musicians, actors, dancers, athletes, journalists, editors, writers, photographers, etc."], ["Community and social service occupations %", "social workers, therapists, counselors, probation officers, clergy, etc."], ["Educational instruction, and library occupations %", "teachers, tutors, professors, librarians, and archivists"], ["Legal occupations %", "lawyers, judges, paralegals, legal assistants, etc."], ["Health diagnosing and treating practitioners and other technical occupations %", "doctors, registered nurses, physical therapists, pharmacists, dietitians, veterinarians, paramedics, etc."], ["Health technologists and technicians %", "radiology technicians, lab technicians, hospital machinery technicians, etc."], ["Business and financial operations occupations %", "sales agents, insurance agents, compliance officers, consultants, fundraisers, accountants, auditors, HR workers, etc."], ["Management occupations %", "a variety of roles titled 'managers'"], ["Construction and extraction occupations %", "carpenters, electricians, plumbers, roofers, miners, etc."], ["Farming, fishing, and forestry occupations %", "farmers, ranchers, fishers, loggers, forest workers, etc."], ["Installation, maintenance, and repair occupations %", "mechanics, HVAC technicians, electricians, plumbers, etc."], ["Material moving occupations %", "forklift operators, stock clerks, conveyor operators, etc."], ["Production occupations %", "assemblers, fabricators, machinists, printing workers, bakers, butchers, upholsterers, woodworkers, chemical processing machine operators, etc."], ["Transportation occupations %", "truck drivers, bus drivers, taxi drivers, pilots, flight attendants, sailors, etc."], ["Office and administrative support occupations %", "secretaries, receptionists, data entry clerks, office clerks, mail carriers, shipping clerks, etc."], ["Sales and related occupations %", "retail salespersons, cashiers, telemarketers, real estate agents, travel agents, travelling salespeople, etc."], ["Building and grounds cleaning and maintenance occupations %", "janitors, maids, groundskeepers (gardeners), pest control workers, etc."], ["Food preparation and serving related occupations %", "cooks, waiters, bartenders, fast food workers, etc."], ["Healthcare support occupations %", "nursing assistants, orderlies, home health aides, massage therapists, dental assistants, etc."], ["Personal care and service occupations %", "hairdressers, childcare workers, fitness trainers, funeral service workers, travel guides, animal trainers, etc."], ["Firefighting and prevention, and other protective service workers including supervisors %", "firefighters, fire inspectors, correctional officers, bailiffs, etc. (effectively, all protective service workers except police officers)"], ["Law enforcement workers including supervisors %", "police officers, detectives, etc."]]